var qBanks = [
    //
    {"Topic":"聲聲慢・秋情","Question":"作者比喻自己為黃花，目的是表達自己年華老去","Ans":["T","F"],"Variant":["是"]},
    {"Topic":"師說","Question":"作者以士大夫的兒子對比士大夫，是要顯示他對士大夫不從師學習的不解","Ans":["T","F","F"],"Variant":["是","士大夫的兒子","不解"]},
    {"Topic":"師說","Question":"作者讚揚古之聖人能從師學習，不像今之聖人","Ans":["NG"],"Variant":[]},
    {"Topic":"論君子","Question":"孔子指出君子經常憂愁恐懼","Ans":["F","T","T"],"Variant":["君子","經常憂愁恐懼"]},
]

var variants = {
    "是":"不是",
    "士大夫的兒子":"孔子",
    "不解":"理解",
    "君子":"小人",
    "經常憂愁恐懼":"心境坦誠"
}